In [1]:
import pandas as pd
import numpy as np

In [2]:
se1 = pd.Series([4,2,0,8], index=list('BDFC'))
se1

B    4
D    2
F    0
C    8
dtype: int64

In [3]:
# 값 정렬
se1.sort_values()

F    0
D    2
B    4
C    8
dtype: int64

In [4]:
# 오름차순
se1.sort_values(ascending=True)

F    0
D    2
B    4
C    8
dtype: int64

In [5]:
# 내림차순
se1.sort_values(ascending=False)

C    8
B    4
D    2
F    0
dtype: int64

In [6]:
se1

B    4
D    2
F    0
C    8
dtype: int64

In [7]:
se1.argsort()

B    2
D    1
F    0
C    3
dtype: int64

In [8]:
se1.idxmin()

'F'

In [9]:
se1.idxmax()

'C'

In [10]:
se2 = pd.Series([40,10,20,30], index=['c','a','b','d'])
se2

c    40
a    10
b    20
d    30
dtype: int64

In [11]:
se2.sort_index()

a    10
b    20
c    40
d    30
dtype: int64

In [12]:
se2.sort_index(ascending=False)

d    30
c    40
b    20
a    10
dtype: int64

In [13]:
df = pd.DataFrame([[2,4,6,8],[1,3,5,7]], index=['Even','Odd'], columns=['One','Two','Three','Four'])
df

      One  Two  Three  Four
Even    2    4      6     8
Odd     1    3      5     7

In [14]:
df.sort_values(by='Three')

      One  Two  Three  Four
Odd     1    3      5     7
Even    2    4      6     8

In [15]:
df.sort_values(by='Three', ascending=False)

      One  Two  Three  Four
Even    2    4      6     8
Odd     1    3      5     7

In [16]:
df2 = pd.DataFrame([[1.0, np.nan, 2.0, 3.0],[9.0, 4.0, 5.0, 6.0]], index=list('CA'), columns=list('dbac'))
df2

     d    b    a    c
C  1.0  NaN  2.0  3.0
A  9.0  4.0  5.0  6.0

In [17]:
df2.sort_values(by='b')

     d    b    a    c
A  9.0  4.0  5.0  6.0
C  1.0  NaN  2.0  3.0

In [18]:
df2.sort_values(by='b', na_position='last')

     d    b    a    c
A  9.0  4.0  5.0  6.0
C  1.0  NaN  2.0  3.0

In [19]:
df2.sort_values(by='b', na_position='first')

     d    b    a    c
C  1.0  NaN  2.0  3.0
A  9.0  4.0  5.0  6.0

In [20]:
df = pd.read_csv('../Pandas/People.csv')
df

               Date  In  Out
0    2020.2.12 0:00  10    3
1    2020.2.12 1:00   7    6
2    2020.2.12 2:00   8    2
3    2020.2.12 3:00   2    6
4    2020.2.12 4:00   4    3
5    2020.2.12 5:00   9    2
6    2020.2.12 6:00   1    1
7    2020.2.12 7:00   1    6
8    2020.2.12 8:00   2    3
9    2020.2.12 9:00   4    2
10  2020.2.12 10:00   5    6

In [21]:
df.sort_values(['In', 'Out'], ascending=['False','True'])

               Date  In  Out
6    2020.2.12 6:00   1    1
7    2020.2.12 7:00   1    6
8    2020.2.12 8:00   2    3
3    2020.2.12 3:00   2    6
9    2020.2.12 9:00   4    2
4    2020.2.12 4:00   4    3
10  2020.2.12 10:00   5    6
1    2020.2.12 1:00   7    6
2    2020.2.12 2:00   8    2
5    2020.2.12 5:00   9    2
0    2020.2.12 0:00  10    3

In [22]:
df2 = pd.DataFrame([{'A' : 2 , 'B' : 1, 'C': 4},
                   {'A': 6, 'B' : 0, 'C' : 7},
                   {'A' : 1, 'B' : 10, 'C' : 5}],
                  columns=['B','A','C'])

In [23]:
df2

    B  A  C
0   1  2  4
1   0  6  7
2  10  1  5

In [24]:
df2.sort_index(axis=1)

   A   B  C
0  2   1  4
1  6   0  7
2  1  10  5

In [25]:
df2 = pd.DataFrame([{'A' : 2 , 'B' : 1, 'C': 4},
                   {'A': 6, 'B' : 0, 'C' : 7},
                   {'A' : 1, 'B' : 10, 'C' : 5}], index=list('CAB'),
                  columns=['B','A','C'])

In [26]:
df2

    B  A  C
C   1  2  4
A   0  6  7
B  10  1  5

In [27]:
df2.sort_index()

    B  A  C
A   0  6  7
B  10  1  5
C   1  2  4

In [28]:
df2.sort_index().sort_index(axis=1)

   A   B  C
A  6   0  7
B  1  10  5
C  2   1  4

In [29]:
data = {'이름' : ['김소혜', '김도연', '최유정', '유연정', '강미나'],
       '학번' : [20200101, 20200102, 20200103, 20200104, 20200105],
       '점수' : [99, 94, 97, 91, 92]}

In [30]:
df3 = pd.DataFrame(data)

In [31]:
df3

    이름        학번  점수
0  김소혜  20200101  99
1  김도연  20200102  94
2  최유정  20200103  97
3  유연정  20200104  91
4  강미나  20200105  92

In [32]:
df3['점수'].rank(ascending=False)

0    1.0
1    3.0
2    2.0
3    5.0
4    4.0
Name: 점수, dtype: float64

In [33]:
df3['순위'] = df3['점수'].rank(ascending=False).astype('int64')

In [34]:
df3

    이름        학번  점수  순위
0  김소혜  20200101  99   1
1  김도연  20200102  94   3
2  최유정  20200103  97   2
3  유연정  20200104  91   5
4  강미나  20200105  92   4

In [35]:
df3.sort_values(by='순위')

    이름        학번  점수  순위
0  김소혜  20200101  99   1
2  최유정  20200103  97   2
1  김도연  20200102  94   3
4  강미나  20200105  92   4
3  유연정  20200104  91   5

In [36]:
df4 = df3.sort_values(by='순위')
df4.index = [0,1,2,3,4]
df4

    이름        학번  점수  순위
0  김소혜  20200101  99   1
1  최유정  20200103  97   2
2  김도연  20200102  94   3
3  강미나  20200105  92   4
4  유연정  20200104  91   5

In [37]:
data = {'A' : pd.Series([2.], index=['One']),
       'B' : pd.Series([2., 4.], index=['One','Two']),
       'C' : pd.Series([2., 4., 6., 8.], index = ['One', 'Two', 'Three', 'Four'])}

In [38]:
df = pd.DataFrame(data)

In [39]:
df

         A    B    C
Four   NaN  NaN  8.0
One    2.0  2.0  2.0
Three  NaN  NaN  6.0
Two    NaN  4.0  4.0

In [40]:
df['B'] = pd.Series([1,3,5,7], index=['One', 'Two', 'Three', 'Four'], dtype='float')

In [41]:
df

         A    B    C
Four   NaN  7.0  8.0
One    2.0  1.0  2.0
Three  NaN  5.0  6.0
Two    NaN  3.0  4.0

In [42]:
df2 = df[['B','C']]

In [43]:
df2

         B    C
Four   7.0  8.0
One    1.0  2.0
Three  5.0  6.0
Two    3.0  4.0

In [44]:
df2.B.shift(-1)

Four     1.0
One      5.0
Three    3.0
Two      NaN
Name: B, dtype: float64

In [45]:
df2.B.shift(1)

Four     NaN
One      7.0
Three    1.0
Two      5.0
Name: B, dtype: float64

In [46]:
df = pd.DataFrame({'Club' : ['Real Madrid', 'Real Madrid','Real Madrid','FC Barcelona','FC Barcelona','FC Barcelona',],
                  'Player' : ['Sergio Ramos', 'Gareth Bale', 'Luke Modric', 
                              'Gerard Pique', 'Lionel Messi', 'Antoine Griezmann'],
                  'Number' : [4, 11, 10, 3, 10, 17]})

In [47]:
df

           Club             Player  Number
0   Real Madrid       Sergio Ramos       4
1   Real Madrid        Gareth Bale      11
2   Real Madrid        Luke Modric      10
3  FC Barcelona       Gerard Pique       3
4  FC Barcelona       Lionel Messi      10
5  FC Barcelona  Antoine Griezmann      17

In [48]:
df.pivot(index = 'Club', columns='Number', values='Player')

Number,3,4,10,11,17
Club,,,,,
FC Barcelona,Gerard Pique,NaN,Lionel Messi,NaN,Antoine Griezmann
Real Madrid,NaN,Sergio Ramos,Luke Modric,Gareth Bale,NaN

In [49]:
df1 = pd.DataFrame({"foo": ['one', 'one', 'two', 'two'],
                   "bar": ['A', 'A', 'B', 'C'],
                   "baz": [1, 2, 3, 4]})
df1

   foo bar  baz
0  one   A    1
1  one   A    2
2  two   B    3
3  two   C    4

In [50]:
df1.pivot(index='foo', columns='bar', values='baz')

ValueError: Index contains duplicate entries, cannot reshape

In [ ]:
df1 = df1.drop_duplicates(['foo','bar'])

In [ ]:
df1

In [ ]:
df1.pivot('foo','bar','baz')

In [74]:
df2 = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo","bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two", "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small","small", "large", "small", "small","large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],"E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df2

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [75]:
table = pd.pivot_table(df2, values='D', index=['A', 'B'], columns=['C'], aggfunc=np.sum)

In [76]:
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [77]:
df2

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [81]:
result = df2.set_index(['B','C'])

In [82]:
result.head(2)

             A  D  E
B   C
one small  foo  1  2
    large  foo  2  4

In [58]:
result = result.stack()

In [59]:
result

B    C
one  small  A    foo
            D      1
            E      2
     large  A    foo
            D      2
            E      4
            A    foo
            D      2
            E      5
two  small  A    foo
            D      3
            E      5
            A    foo
            D      3
            E      6
one  large  A    bar
            D      4
            E      6
     small  A    bar
            D      5
            E      8
two  small  A    bar
            D      6
            E      9
     large  A    bar
            D      7
            E      9
dtype: object

In [60]:
result.index

MultiIndex([('one', 'small', 'A'),
            ('one', 'small', 'D'),
            ('one', 'small', 'E'),
            ('one', 'large', 'A'),
            ('one', 'large', 'D'),
            ('one', 'large', 'E'),
            ('one', 'large', 'A'),
            ('one', 'large', 'D'),
            ('one', 'large', 'E'),
            ('two', 'small', 'A'),
            ('two', 'small', 'D'),
            ('two', 'small', 'E'),
            ('two', 'small', 'A'),
            ('two', 'small', 'D'),
            ('two', 'small', 'E'),
            ('one', 'large', 'A'),
            ('one', 'large', 'D'),
            ('one', 'large', 'E'),
            ('one', 'small', 'A'),
            ('one', 'small', 'D'),
            ('one', 'small', 'E'),
            ('two', 'small', 'A'),
            ('two', 'small', 'D'),
            ('two', 'small', 'E'),
            ('two', 'large', 'A'),
            ('two', 'large', 'D'),
            ('two', 'large', 'E')],
           names=['B', 'C', None])

In [61]:
result.index.levels

FrozenList([['one', 'two'], ['large', 'small'], ['A', 'D', 'E']])

In [62]:
result.index.get_level_values(0)

Index(['one', 'one', 'one', 'one', 'one', 'one', 'one', 'one', 'one', 'two',
       'two', 'two', 'two', 'two', 'two', 'one', 'one', 'one', 'one', 'one',
       'one', 'two', 'two', 'two', 'two', 'two', 'two'],
      dtype='object', name='B')

In [63]:
result.index.get_level_values(1)

Index(['small', 'small', 'small', 'large', 'large', 'large', 'large', 'large',
       'large', 'small', 'small', 'small', 'small', 'small', 'small', 'large',
       'large', 'large', 'small', 'small', 'small', 'small', 'small', 'small',
       'large', 'large', 'large'],
      dtype='object', name='C')

In [64]:
result.index.get_level_values(2)

Index(['A', 'D', 'E', 'A', 'D', 'E', 'A', 'D', 'E', 'A', 'D', 'E', 'A', 'D',
       'E', 'A', 'D', 'E', 'A', 'D', 'E', 'A', 'D', 'E', 'A', 'D', 'E'],
      dtype='object')

In [65]:
result[0]

'foo'

In [66]:
result.loc['one']['small']['A']

A    foo
A    bar
dtype: object

In [67]:
result.values

array(['foo', 1, 2, 'foo', 2, 4, 'foo', 2, 5, 'foo', 3, 5, 'foo', 3, 6,
       'bar', 4, 6, 'bar', 5, 8, 'bar', 6, 9, 'bar', 7, 9], dtype=object)

In [68]:
r_df = result.to_frame()
r_df.head()

               0
B   C
one small A  foo
          D    1
          E    2
    large A  foo
          D    2

In [69]:
r_df.tail()

               0
B   C
two small D    6
          E    9
    large A  bar
          D    7
          E    9

In [70]:
r_df.index.levels

FrozenList([['one', 'two'], ['large', 'small'], ['A', 'D', 'E']])

In [71]:
r_df.columns

RangeIndex(start=0, stop=1, step=1)

In [91]:
# unstack에 사용할 데이터프레임 생성
df = pd.read_csv('../Pandas/JuveAndBarcelona.csv')
df

           name  round season win
0      Juventus      1  19-20   W
1  FC Barcelona      1  19-20   L
2      Juventus      2  19-20   W
3  FC Barcelona      2  19-20   W
4      Juventus      3  19-20   D
5  FC Barcelona      3  19-20   D
6      Juventus      4  19-20   W
7  FC Barcelona      4  19-20   W
8      Juventus      5  19-20   W
9  FC Barcelona      5  19-20   L

In [93]:
# 행의 인덱스를 멀티인덱스로 변환하기 위한 두 인덱스 지정
un_df = df.set_index(['name','round'])

In [94]:
un_df

                   season win
name         round
Juventus     1      19-20   W
FC Barcelona 1      19-20   L
Juventus     2      19-20   W
FC Barcelona 2      19-20   W
Juventus     3      19-20   D
FC Barcelona 3      19-20   D
Juventus     4      19-20   W
FC Barcelona 4      19-20   W
Juventus     5      19-20   W
FC Barcelona 5      19-20   L

In [96]:
unstack = un_df.unstack()

In [97]:
unstack

             season                             win
round             1      2      3      4      5   1  2  3  4  5
name
FC Barcelona  19-20  19-20  19-20  19-20  19-20   L  W  D  W  L
Juventus      19-20  19-20  19-20  19-20  19-20   W  W  D  W  W

In [98]:
un_unstack = un_df.unstack().unstack()

In [100]:
type(un_unstack)

pandas.core.series.Series

In [101]:
df_s = df['win']

In [102]:
df_s.index = un_df['win'].index

In [103]:
df_s

name          round
Juventus      1        W
FC Barcelona  1        L
Juventus      2        W
FC Barcelona  2        W
Juventus      3        D
FC Barcelona  3        D
Juventus      4        W
FC Barcelona  4        W
Juventus      5        W
FC Barcelona  5        L
Name: win, dtype: object

In [104]:
df_s.unstack()

round         1  2  3  4  5
name
FC Barcelona  L  W  D  W  L
Juventus      W  W  D  W  W

In [105]:
df_s.unstack(level=0)

name  FC Barcelona Juventus
round
1                L        W
2                W        W
3                D        D
4                W        W
5                L        W

In [106]:
df_s.unstack(level=1)

round         1  2  3  4  5
name
FC Barcelona  L  W  D  W  L
Juventus      W  W  D  W  W

In [16]:
columns = np.array(['Premier League', 'Laliga', 'SerieA'])

In [17]:
dataElement = np.array([['Liverpool', 'Manchester City', 'Manchester United'],
                       ['Real Madrid', 'FC Barcelona', 'Atletico de Madrid'],
                       ['Juventus', 'AS Roma', 'AC Millan']])

In [20]:
df1 = pd.DataFrame(dataElement, columns=columns)

In [21]:
df1

  Premier League           Laliga              SerieA
0      Liverpool  Manchester City   Manchester United
1    Real Madrid     FC Barcelona  Atletico de Madrid
2       Juventus          AS Roma           AC Millan

In [22]:
df1 = pd.DataFrame(dataElement.T, columns=columns)
df1

      Premier League              Laliga     SerieA
0          Liverpool         Real Madrid   Juventus
1    Manchester City        FC Barcelona    AS Roma
2  Manchester United  Atletico de Madrid  AC Millan

In [23]:
dataElement2 = np.array([['Chelsea', 'Arsenal', 'Tottenham Hotspur'],
                       ['Real Sociedad', 'Alaves', 'Athletic Club'],
                       ['ACF Fiorentina', 'Atalanta BC', 'Brescia Calcio']])

In [24]:
df2 = pd.DataFrame(dataElement2.T, columns=columns)
df2

      Premier League         Laliga          SerieA
0            Chelsea  Real Sociedad  ACF Fiorentina
1            Arsenal         Alaves     Atalanta BC
2  Tottenham Hotspur  Athletic Club  Brescia Calcio

In [25]:
df_ct = pd.concat([df1,df2])
df_ct

      Premier League              Laliga          SerieA
0          Liverpool         Real Madrid        Juventus
1    Manchester City        FC Barcelona         AS Roma
2  Manchester United  Atletico de Madrid       AC Millan
0            Chelsea       Real Sociedad  ACF Fiorentina
1            Arsenal              Alaves     Atalanta BC
2  Tottenham Hotspur       Athletic Club  Brescia Calcio

In [29]:
r_idx = [x for x in range(0, 6)]

In [30]:
r_idx

[0, 1, 2, 3, 4, 5]

In [31]:
df_ct.index = r_idx

In [32]:
df_ct

      Premier League              Laliga          SerieA
0          Liverpool         Real Madrid        Juventus
1    Manchester City        FC Barcelona         AS Roma
2  Manchester United  Atletico de Madrid       AC Millan
3            Chelsea       Real Sociedad  ACF Fiorentina
4            Arsenal              Alaves     Atalanta BC
5  Tottenham Hotspur       Athletic Club  Brescia Calcio

In [33]:
df_ct2 = pd.concat([df1,df2], ignore_index = True)
df_ct2

      Premier League              Laliga          SerieA
0          Liverpool         Real Madrid        Juventus
1    Manchester City        FC Barcelona         AS Roma
2  Manchester United  Atletico de Madrid       AC Millan
3            Chelsea       Real Sociedad  ACF Fiorentina
4            Arsenal              Alaves     Atalanta BC
5  Tottenham Hotspur       Athletic Club  Brescia Calcio

In [34]:
df_ct3 = pd.concat([df1,df2], axis=1)
df_ct3

,Premier League,Laliga,SerieA,Premier League,Laliga,SerieA
0,Liverpool,Real Madrid,Juventus,Chelsea,Real Sociedad,ACF Fiorentina
1,Manchester City,FC Barcelona,AS Roma,Arsenal,Alaves,Atalanta BC
2,Manchester United,Atletico de Madrid,AC Millan,Tottenham Hotspur,Athletic Club,Brescia Calcio

In [35]:
c_list = ['Premier League A', 'Laliga A', 'SerieA A', 
          'Premier League B', 'Laliga B', 'SerieA B']

In [36]:
df_ct3.columns = c_list

In [37]:
df_ct3

,Premier League A,Laliga A,SerieA A,Premier League B,Laliga B,SerieA B
0,Liverpool,Real Madrid,Juventus,Chelsea,Real Sociedad,ACF Fiorentina
1,Manchester City,FC Barcelona,AS Roma,Arsenal,Alaves,Atalanta BC
2,Manchester United,Atletico de Madrid,AC Millan,Tottenham Hotspur,Athletic Club,Brescia Calcio

In [38]:
df_ct4 = pd.concat([df1,df2], axis=1, ignore_index=True)
df_ct4

,0,1,2,3,4,5
0,Liverpool,Real Madrid,Juventus,Chelsea,Real Sociedad,ACF Fiorentina
1,Manchester City,FC Barcelona,AS Roma,Arsenal,Alaves,Atalanta BC
2,Manchester United,Atletico de Madrid,AC Millan,Tottenham Hotspur,Athletic Club,Brescia Calcio

In [39]:
df1

      Premier League              Laliga     SerieA
0          Liverpool         Real Madrid   Juventus
1    Manchester City        FC Barcelona    AS Roma
2  Manchester United  Atletico de Madrid  AC Millan

In [40]:
c_df = df1.copy()

In [41]:
# 인덱서를 통한 데이터 추가
c_df.loc[4] = ['Chelsea', 'Real Sociedad', 'Inter']

In [42]:
c_df

      Premier League              Laliga     SerieA
0          Liverpool         Real Madrid   Juventus
1    Manchester City        FC Barcelona    AS Roma
2  Manchester United  Atletico de Madrid  AC Millan
4            Chelsea       Real Sociedad      Inter

In [44]:
# .append 메소드를 통한 데이터 추가  
c_df2 = c_df.append({'Premier League' : 'Arsenal', 'Laliga' : 'Real Betis', 'SerieA' : 'Atalanta BC'},
                    ignore_index=True)

In [45]:
c_df2

      Premier League              Laliga       SerieA
0          Liverpool         Real Madrid     Juventus
1    Manchester City        FC Barcelona      AS Roma
2  Manchester United  Atletico de Madrid    AC Millan
3            Chelsea       Real Sociedad        Inter
4            Arsenal          Real Betis  Atalanta BC

In [47]:
dataElement3 = np.array([['AFC Bournemouth', 'Aston Villa', 'Brighton and Hove Albion'],
                        ['Alaves', 'CD Leganes', 'Getafe CF'],
                        ['Bayer 04 Leverkusen', 'Borussia Dortmund', 'Eintracht Frankfurt']])

In [48]:
columns2 = (['Premier League', 'Laliga', 'Bundesliga'])

In [49]:
df3 = pd.DataFrame(dataElement3.T, columns=columns2)

In [50]:
df3

             Premier League      Laliga           Bundesliga
0           AFC Bournemouth      Alaves  Bayer 04 Leverkusen
1               Aston Villa  CD Leganes    Borussia Dortmund
2  Brighton and Hove Albion   Getafe CF  Eintracht Frankfurt

In [51]:
df4 = pd.concat([df1, df3], join='inner', ignore_index=True)
df4

             Premier League              Laliga
0                 Liverpool         Real Madrid
1           Manchester City        FC Barcelona
2         Manchester United  Atletico de Madrid
3           AFC Bournemouth              Alaves
4               Aston Villa          CD Leganes
5  Brighton and Hove Albion           Getafe CF

In [52]:
df5 = pd.concat([df1, df3], axis=1, join='inner', ignore_index=True)
df5

,0,1,2,3,4,5
0,Liverpool,Real Madrid,Juventus,AFC Bournemouth,Alaves,Bayer 04 Leverkusen
1,Manchester City,FC Barcelona,AS Roma,Aston Villa,CD Leganes,Borussia Dortmund
2,Manchester United,Atletico de Madrid,AC Millan,Brighton and Hove Albion,Getafe CF,Eintracht Frankfurt

In [54]:
df6 = pd.concat([df1, df3], axis=1, join='outer', ignore_index=True)
df6

,0,1,2,3,4,5
0,Liverpool,Real Madrid,Juventus,AFC Bournemouth,Alaves,Bayer 04 Leverkusen
1,Manchester City,FC Barcelona,AS Roma,Aston Villa,CD Leganes,Borussia Dortmund
2,Manchester United,Atletico de Madrid,AC Millan,Brighton and Hove Albion,Getafe CF,Eintracht Frankfurt

In [61]:
tmp = [4,5,6]

In [62]:
df3_1 = df3

In [63]:
df3_1.index = tmp

In [64]:
df3_1

             Premier League      Laliga           Bundesliga
4           AFC Bournemouth      Alaves  Bayer 04 Leverkusen
5               Aston Villa  CD Leganes    Borussia Dortmund
6  Brighton and Hove Albion   Getafe CF  Eintracht Frankfurt

In [65]:
df6 = pd.concat([df1, df3_1], axis=1, join='outer', ignore_index=True)
df6

,0,1,2,3,4,5
0,Liverpool,Real Madrid,Juventus,NaN,NaN,NaN
1,Manchester City,FC Barcelona,AS Roma,NaN,NaN,NaN
2,Manchester United,Atletico de Madrid,AC Millan,NaN,NaN,NaN
4,NaN,NaN,NaN,AFC Bournemouth,Alaves,Bayer 04 Leverkusen
5,NaN,NaN,NaN,Aston Villa,CD Leganes,Borussia Dortmund
6,NaN,NaN,NaN,Brighton and Hove Albion,Getafe CF,Eintracht Frankfurt

In [66]:
df6_1 = pd.concat([df1, df3_1], axis=1, join='inner', ignore_index=True)
df6_1

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5]
Index: []

In [78]:
pd.concat([df1,df3], axis=1, keys=['df1', 'df3'], join='outer')

                 df1                                                      df3  \
      Premier League              Laliga     SerieA            Premier League
0          Liverpool         Real Madrid   Juventus                       NaN
1    Manchester City        FC Barcelona    AS Roma                       NaN
2  Manchester United  Atletico de Madrid  AC Millan                       NaN
4                NaN                 NaN        NaN           AFC Bournemouth
5                NaN                 NaN        NaN               Aston Villa
6                NaN                 NaN        NaN  Brighton and Hove Albion


       Laliga           Bundesliga
0         NaN                  NaN
1         NaN                  NaN
2         NaN                  NaN
4      Alaves  Bayer 04 Leverkusen
5  CD Leganes    Borussia Dortmund
6   Getafe CF  Eintracht Frankfurt

In [79]:
pd.concat([df1,df3], keys=['df1', 'df3'], join='inner')

                 Premier League              Laliga
df1 0                 Liverpool         Real Madrid
    1           Manchester City        FC Barcelona
    2         Manchester United  Atletico de Madrid
df3 4           AFC Bournemouth              Alaves
    5               Aston Villa          CD Leganes
    6  Brighton and Hove Albion           Getafe CF

In [81]:
df1.join(df3, how='outer', lsuffix='_lx', rsuffix='_rx')

,Premier League_lx,Laliga_lx,SerieA,Premier League_rx,Laliga_rx,Bundesliga
0,Liverpool,Real Madrid,Juventus,NaN,NaN,NaN
1,Manchester City,FC Barcelona,AS Roma,NaN,NaN,NaN
2,Manchester United,Atletico de Madrid,AC Millan,NaN,NaN,NaN
4,NaN,NaN,NaN,AFC Bournemouth,Alaves,Bayer 04 Leverkusen
5,NaN,NaN,NaN,Aston Villa,CD Leganes,Borussia Dortmund
6,NaN,NaN,NaN,Brighton and Hove Albion,Getafe CF,Eintracht Frankfurt

In [85]:
premier = pd.read_csv('../Pandas/premier_18-19.csv')
premier.head()

,home_team,away_team,home_goals,away_goals,result,season
0,Manchester United,Leicester City,2,1,H,2018-2019
1,AFC Bournemouth,Cardiff City,2,0,H,2018-2019
2,Fulham,Crystal Palace,0,2,A,2018-2019
3,Huddersfield Town AFC,Chelsea,0,3,A,2018-2019
4,Newcastle United,Tottenham Hotspur,1,2,A,2018-2019

In [86]:
df_pl = pd.melt(premier, id_vars=['home_team'], value_vars=['home_goals'])

In [87]:
df_pl.head()

                home_team    variable  value
0       Manchester United  home_goals      2
1         AFC Bournemouth  home_goals      2
2                 Fulham   home_goals      0
3  Huddersfield Town AFC   home_goals      0
4       Newcastle United   home_goals      1

In [88]:
df_pl2 = pd.melt(premier, id_vars=['home_team'], value_vars=['home_goals'], var_name='goals', value_name='score')

In [90]:
df_pl2.head()

                home_team       goals  score
0       Manchester United  home_goals      2
1         AFC Bournemouth  home_goals      2
2                 Fulham   home_goals      0
3  Huddersfield Town AFC   home_goals      0
4       Newcastle United   home_goals      1

In [91]:
df_pl3 = pd.melt(premier, id_vars=['home_team','away_team'], value_vars=['home_goals','away_goals']
                 , var_name='goals', value_name='score')

In [93]:
df_pl3.head()

                home_team            away_team       goals  score
0       Manchester United     Leicester City    home_goals      2
1         AFC Bournemouth       Cardiff City    home_goals      2
2                 Fulham      Crystal Palace    home_goals      0
3  Huddersfield Town AFC             Chelsea    home_goals      0
4       Newcastle United   Tottenham Hotspur    home_goals      1

In [94]:
df_pl3.tail()

                home_team                  away_team       goals  score
755          Liverpool     Wolverhampton Wanderers    away_goals      0
756  Manchester United                Cardiff City    away_goals      2
757        Southampton       Huddersfield Town AFC    away_goals      1
758  Tottenham Hotspur                    Everton     away_goals      2
759            Watford             West Ham United    away_goals      4